Revit 2024 API
BuiltInFailures.RoomFailures.CannotMakeRoomsGeometry Property
 Could not create geometry for [Room].
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotMakeRoomsGeometry { get; }
Visual Basic
Public Shared ReadOnly Property CannotMakeRoomsGeometry As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotMakeRoomsGeometry {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.RoomFailures Class
Autodesk.Revit.DB Namespace